hw1_2020/0.org/nut
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0";
 object nut;
}

dimensions [ 0 2 -1 0 0 0 0 ];

internalField uniform 0;

boundaryField
{
  inlet
  {
    type calculated;
    value uniform 0;
  }
  outlet
  {
    type calculated;
    value uniform 0;
  }
  farField
  {
    type zeroGradient;
  }
  wall
  {
    type zeroGradient;
  }
  wedge2
  {
    type wedge;
  }
  wedge1
  {
    type wedge;
  }
} 	// ************************************************************************* //

