hw1_2020/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5-dev                               |
|   \\  /    A nd           | Revision: 1718                                  |
|    \\/     M anipulation  | Web:      http://www.OpenFOAM.org               |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      funkySetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(
        Ujet 
        {
          field U;
          dimension [0 1 -1 0 0 0 0];
          keepPatches 1;
          condition "pos().y < 0.0127";
          expression "vector(56.2,0,0)";
        }

        kjet
        {
          field k;
          dimension [0 2 -2 0 0 0 0];
          keepPatches 1;
          condition "pos().y < 0.0127";
          expression "0.1594";
        }

        epsilonJet
        {
          field epsilon;
          dimension [0 2 -3 0 0 0 0];
          keepPatches 1;
          condition "pos().y < 0.0127";
          expression "0.23";
        }

);
