hw1_2020/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    system;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Set output format : choice of
//      xmgr
//      jplot
//      gnuplot
//      raw
setFormat raw;

// Surface output format. Choice of
//      null        : suppress output
//      foamFile    : separate points, faces and values file
//      dx          : DX scalar or vector format
//      vtk         : VTK ascii format
//      raw         : x y z value format for use with e.g. gnuplot 'splot'.
//
// Note:
// other formats such as obj, stl, etc can also be written (by proxy)
// but without any values!
surfaceFormat vtk;

// interpolationScheme. choice of
//      cell          : use cell-centre value only; constant over cells (default)
//      cellPoint     : use cell-centre and vertex values
//      cellPointFace : use cell-centre, vertex and face values.
// 1] vertex values determined from neighbouring cell-centre values
// 2] face values determined using the current face interpolation scheme
//    for the field (linear, gamma, etc.)
interpolationScheme cellPoint;

// Fields to sample.
fields
(
    U
    k
    epsilon
    nut
    Rxx
    Rxy
    Rxz
    Ryy
    Ryz
    Rzz
);

// Set sampling definition: choice of
//      uniform             evenly distributed points on line
//      face                one point per face intersection
//      midPoint            one point per cell, inbetween two face intersections
//      midPoint     combination of face and midPoint
//
//      curve               specified points, not nessecary on line, uses
//                          tracking
//      cloud               specified points, uses findCell
//
// axis: how to write point coordinate. Choice of
// - x/y/z: x/y/z coordinate only
// - xyz: three columns
//  (probably does not make sense for anything but raw)
// - distance: distance from start of sampling line (if uses line) or
//             distance from first specified sampling point
//
// type specific:
//      uniform, face, midPoint, midPoint : start and end coordinate
//      uniform: extra number of sampling points
//      curve, cloud: list of coordinates
sets
(
    centerline
    {
        type        midPoint;
        axis        xyz;
        start       (0 1e-5  0);
        end         (4 1e-5  0);
    }
    lineY0p0254
    {
        type        midPoint;
        axis        xyz;
        start       (0.0254   0  0);
        end         (0.0254 0.5  0);
    }
    lineY0p0762
    {
        type        midPoint;
        axis        xyz;
        start       (0.0762  0  0);
        end         (0.0762 0.5  0);
    }
    lineY0p254
    {
        type        midPoint;
        axis        xyz;
        start       (0.254   0  0);
        end         (0.254 0.5  0);
    }
    lineY0p508
    {
        type        midPoint;
        axis        xyz;
        start       (0.508   0  0);
        end         (0.508 0.5  0);
    }
    lineY1p016
    {
        type        midPoint;
        axis        xyz;
        start       (1.016   0  0);
        end         (1.016 0.5  0);
    }
    lineY1p524
    {
        type        midPoint;
        axis        xyz;
        start       (1.524   0  0);
        end         (1.524 0.5  0);
    }
    lineY2p032
    {
        type        midPoint;
        axis        xyz;
        start       (2.032   0  0);
        end         (2.032 0.5  0);
    }
);

// Surface sampling definition: choice of
//      plane : values on plane defined by point, normal.
//      patch : values on patch.
//
// 1] patches are not triangulated by default
// 2] planes are always triangulated
// 3] iso-surfaces are always triangulated
surfaces
(

);

// *********************************************************************** //
